Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyNoExternalParametersCorruption
Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.